#+TITLE: Cowsay tests

* 1. Define Example

Define runnable examples using source-code blocks.

#+NAME: cowsay
#+begin_src shell :results output
nix run nixpkgs#cowsay -- "Hello"
#+end_src

#+RESULTS: cowsay
:  _______
: < Hello >
:  -------
:         \   ^__^
:          \  (oo)\_______
:             (__)\       )\/\
:                 ||----w |
:                 ||     ||

* 2. Write down expectations

In the source code block above, [[cowsay]] should include this:

#+NAME: expect-cowsay-includes
#+begin_example
Hello
#+end_example

And it should be equal to:

#+NAME: expect-cowsay-equals
#+begin_example
 _______
< Hello >
 -------
        \   ^__^
         \  (oo)\_______
            (__)\       )\/\
                ||----w |
                ||     ||
#+end_example
